---
kind: type
id: T:Autodesk.Revit.DB.DGNFileFormat
source: html/a3229830-0f4f-8732-2d2f-554b4ef86b1a.htm
---
# Autodesk.Revit.DB.DGNFileFormat

An enumerated type listing available Microstation versions into which a file may be exported.

## Syntax (C#)
```csharp
public enum DGNFileFormat
```